In [1]:
import pandas as pd

In [5]:
frutas = ['a', 'b', 'c', 'd']
cantidades = [20, 32, 52, 10]
ss = pd.Series(cantidades, index=frutas)
print(ss)

a    20
b    32
c    52
d    10
dtype: int64

In [7]:
ss.get('a')

20

In [8]:
ss['f'] = 33
ss

a    20
b    32
c    52
d    10
f    33
dtype: int64

# Dataframe

In [10]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]], columns=['col_1', 'col_2', 'col_3', 'col_4'])
df

   col_1  col_2  col_3  col_4
0      1      2      3      4
1      5      6      7      8

In [61]:
data = pd.read_csv('datos/registro.csv', encoding= "ISO-8859-1")
data

   codigo  nombre    appelido sexo
0     123    Juan        Perz    M
1     321   Lucia     Alvarez    F
2      15  CArlos        Hale    M
3      10   Sofia       Silar    M
4    7676  Victor  Villacorta    M
5   95849  kendal  Villacorta    M
6     495   Sammy     Pacheco    F

In [62]:
data.shape

(7, 4)

In [63]:
data.info

<bound method DataFrame.info of    codigo  nombre    appelido sexo
0     123    Juan        Perz    M
1     321   Lucia     Alvarez    F
2      15  CArlos        Hale    M
3      10   Sofia       Silar    M
4    7676  Victor  Villacorta    M
5   95849  kendal  Villacorta    M
6     495   Sammy     Pacheco    F>

In [64]:
import numpy as np
#Breve descripcion de los datos
data.describe(include = [np.int64, object, float])

              codigo  nombre    appelido sexo
count       7.000000       7           7    7
unique           NaN       7           6    2
top              NaN  Victor  Villacorta    M
freq             NaN       1           2    5
mean    14927.000000     NaN         NaN  NaN
std     35792.475918     NaN         NaN  NaN
min        10.000000     NaN         NaN  NaN
25%        69.000000     NaN         NaN  NaN
50%       321.000000     NaN         NaN  NaN
75%      4085.500000     NaN         NaN  NaN
max     95849.000000     NaN         NaN  NaN

In [65]:
data.head(3)

   codigo  nombre appelido sexo
0     123    Juan     Perz    M
1     321   Lucia  Alvarez    F
2      15  CArlos     Hale    M

In [71]:
#acceso a los dat0s
data[['sexo', 'appelido']]

  sexo    appelido
0    F     Alvarez
1    M        Hale
2    F     Pacheco
3    M        Perz
4    M       Silar
5    M  Villacorta
6    M  Villacorta

In [68]:
data = data.sort_values('appelido')
data

   codigo  nombre    appelido sexo
1     321   Lucia     Alvarez    F
2      15  CArlos        Hale    M
6     495   Sammy     Pacheco    F
0     123    Juan        Perz    M
3      10   Sofia       Silar    M
4    7676  Victor  Villacorta    M
5   95849  kendal  Villacorta    M

In [69]:
data.reset_index(drop=True, inplace=True)

In [70]:
data

   codigo  nombre    appelido sexo
0     321   Lucia     Alvarez    F
1      15  CArlos        Hale    M
2     495   Sammy     Pacheco    F
3     123    Juan        Perz    M
4      10   Sofia       Silar    M
5    7676  Victor  Villacorta    M
6   95849  kendal  Villacorta    M

In [73]:
data[data['appelido']=='Hale']

   codigo  nombre appelido sexo
1      15  CArlos     Hale    M

In [74]:
data.groupby(by='sexo')['codigo'].mean()

sexo
F      408.0
M    20734.6
Name: codigo, dtype: float64

In [75]:
data.groupby(by='sexo')['codigo'].groups

{'F': Int64Index([0, 2], dtype='int64'),
 'M': Int64Index([1, 3, 4, 5, 6], dtype='int64')}

In [76]:
data.groupby(by='sexo')['codigo'].count()

sexo
F    2
M    5
Name: codigo, dtype: int64

In [82]:
data.groupby(by='sexo', as_index=False).aggregate({'codigo':'mean', 'appelido': 'count'})

  sexo   codigo  appelido
0    F    408.0         2
1    M  20734.6         5

In [90]:
data.rename(
  columns={
    'title' : 'codigo',
    'appelido' : 'apellido'
  },
  inplace=True
)
data

   codigo  nombre    apellido sexo
0     321   Lucia     Alvarez    F
1      15  CArlos        Hale    M
2     495   Sammy     Pacheco    F
3     123    Juan        Perz    M
4      10   Sofia       Silar    M
5    7676  Victor  Villacorta    M
6   95849  kendal  Villacorta    M